app/controllers/unofficials_controller.rb

SELECT `unofficials`.* FROM `unofficials`
---
  def index
    @unofficials = Unofficial.all

INSERT INTO `unofficials` (`homework`, `description`, `subject`, `assigned_by`, `assigned_in`, `assigned_for`, `created_at`, `updated_at`) VALUES ('greg', 'greg', 'greg', 'greg', '2017-04-24', '2017-04-27', '2017-04-24 11:16:31', '2017-04-24 11:16:31')
---
  def create
    @unofficial = Unofficial.new(unofficial_params)

    respond_to do |format|
      if @unofficial.save

UPDATE `unofficials` SET `description` = 'gciao\r\n', `updated_at` = '2017-04-24 11:16:51' WHERE `unofficials`.`id` = 1
---
  def update
    respond_to do |format|
      if @unofficial.update(unofficial_params)

DELETE FROM `unofficials` WHERE `unofficials`.`id` = 1
---
  def destroy
    @unofficial.destroy

SELECT  `unofficials`.* FROM `unofficials` WHERE `unofficials`.`id` = 1 LIMIT 1
---
    def set_unofficial
      @unofficial = Unofficial.find(params[:id])